js-project-backend/app/controllers/api/v1/movies_controller.rb

SELECT "movies".* FROM "movies"
---
    def index
        movies = Movie.all

INSERT INTO "movies" ("title", "director", "summary", "review", "rating", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        movie = Movie.create(movie_params)

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 10]]
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def destroy
        movie = Movie.find_by(:id => params[:id]).destroy